'''(№ 4587) На числовой прямой даны два отрезка: P = [20, 50] и Q = [30, 40]. Найдите наименьшую возможную длину отрезка A, при котором формула

¬(x ∈ A) ∧ ((x ∈ P) ∨ (x ∈ Q))
тождественно ложна, то есть принимает значение 0 при любых x. '''

def P(x):
    return 20<=x<=50
def Q(x):
    return 30<=x<=40
a = list()
for a1 in range(1,999):
    for a2 in  range(a1,999):
        FLAG = 0
        x = -100
        while x<100:
            x = x + 0.5
            if (not(a1<=x<=a2)) and ((P(x)) or (Q(x))):
                FLAG +=1
        if FLAG == 0:
            a.append(a2-a1)
print(min(a))
