'''(№ 6892) (Н. Сафронов) В файле 17-385.txt содержится последовательность целых неотрицательных чисел, не превышающих 10000.
 Определите количество пар элементов последовательности, в которых каждое число больше максимального из тех элементов последовательности,
  сумма цифр которых минимальна. В ответе запишите два числа: сначала количество найденных пар, затем максимальную сумму цифр элементов таких пар.
   В данной задаче под парой подразумевается два идущих подряд элемента последовательности. '''
