'''(№ 5023) (PRO100 ЕГЭ) Укажите наименьшее целое значение А, при котором выражение

(680·y + 256·x < A) ∨ (5·x + 3·y > 11112)
тождественно истинно, т.е. принимает значение 1 при любых целых неотрицательных x и y? '''

for A in range(2518720,9999999):
    num = 0
    for x in range(0,9999):

        for y in range(0,9999):
            if ((680*y + 256*x) < A) or ((5*x + 3*y) > 11112):
                None
            else:
                num+=1
                break
        if num != 0:
            break

    if num == 0:
        print(A)
        break

