'''(№ 4965) Алгоритм вычисления значения функции F(n), где n – целое неотрицательное число, задан следующими соотношениями:

F(0) = 1
F(n) = 1 + F(n - 1), если n > 0 и n нечётное
F(n) = F(n / 2) в остальных случаях

Определите количество значений n на отрезке [1, 500 000 000], для которых F(n) = 4. '''
# from functools import lru_cache
#
#
#
#
# #Зависмости не нашёл
#
# @lru_cache
# def F(n):
#     if n == 0:
#         return 1
#     if n  % 2 != 0:
#         return 1 + F(n - 1)
#     else:
#         return F(n // 2)
# c = 0
# for n in range(1,100):
#         print(n,F(n),bin(n)[2::])
#
#
# print(c)
# # #7 11 13 19

# f = list()
# x = 1
# c = 0
# while x <= 500000000:
#     if bin(x)[2::].count("1") == 3:
#         c=+1
#     x=+1
#
# print(c)

