'''(№ 6287) Исполнитель Калькулятор преобразует число, записанное на экране. У исполнителя есть четыре команды, которым присвоены номера:

1. прибавь 1
2. прибавь 2
3. умножь на 2
4. умножь на 3

Выполняя первую из них, исполнитель увеличивает число на экране на 1, выполняя вторую – увеличивает на 2,
выполняя третью – умножает на 2, выполняя четвертую – умножает на 3.
Сколько существует различных программ,
 преобразующих число 1 в число 55555 и не содержат двух подряд идущих команд сложения
 и двух подряд идущих команд умножения? '''
#Копия какого-то задания,которое я определённо делал. Буквально copy/paste
