'''(№ 4619) Значение выражения 11•15**65 + 18•15**38 – 14•15**17 + 19•15**11 + 18338 записали в системе счисления с основанием 15.
Сколько различных цифр содержится в этой записи? '''

dic = {10: "a", 11: "b", 12: "c", 13: "d", 14: "f"}
def ABSOLUTESOLVER(n,c):
    f = set()
    while n != 0:

        if n % c > 9:
            f.add(dic.get(n % c))
        else:
            f.add(str(n % c))
        n = n // c



    return len(f)


print(ABSOLUTESOLVER(11*15**65 + 18*15**38 - 14*15**17 + 19*15**11 + 18338,15))
