'''(№ 5269) (Е. Джобс) На числовой прямой даны два отрезка: P = [117; 158] и Q = [129; 180].
Найдите наименьшую возможную длину отрезка A, при котором формула

(x ∈ P) → ( ((x ∈ Q) ∧ ¬(x ∈ A)) → ¬(x ∈ P)) )

тождественно истинна, то есть принимает значение 1 при любых x. '''


def P():
    return 117<=x<=158
def Q():
    return 129<=x<=180

a = list()
for a1 in range(1,300):
    for a2 in range(a1+1,300):
        FLAG = 0
        x = -300
        while x<300:
            x = x + 0.5
            if (P() <= ( ((Q()) and (not(a1<=x <=a2 ))) <= (not(P())) )):
                None
            else:
                FLAG +=1
                break
        if FLAG ==0:
            a.append(a2-a1)

print(min(a))