'''(№ 6114) (А. Богданов) На числовой прямой даны два отрезка: B = [23; 37] и C = [41; 73]. Укажите наименьшую длину такого отрезка А,
 для которого логическое выражение

¬((¬(x ∈ B) → (x ∈ C)) → (x ∈ A))

тождественно ложно, т. е. принимает значение 0 при любом значении переменной x. '''

def B(x):
    return 23<=x<=37
def C(x):
    return  41<=x<=73
a = list()
for a1 in range(1,999):
    for a2 in range(a1+1,999):
        FLAG = 0
        x = -300
        while x<300:
            x = x + 0.5
            if not(not(( (not(B(x))) <= (C(x))) <= (a1<=x<=a2))):
                None
            else:
                FLAG +=1
                break
        if FLAG ==0:
            a.append(a2-a1)
print(min(a))

