'''(№ 6385) (А. Богданов) На числовой прямой даны два отрезка: P = [13; 19] и Q = [17; 23].
 Укажите наибольшую возможную длину такого отрезка A, что формула

¬(¬(x ∈ P) → (x ∈ Q)) → ((x ∈ A) →(¬(x ∈ Q)→(x ∈ P)))

тождественно истинна, то есть принимает значение 1 при любом значении переменной х?'''
def P(x):
    return 13<=x<=19
def Q(x):
    return 17<=x<=23
a = list()
for a1 in range(1,300):
    for a2 in range(a1+1,300):
        FLAG = 0
        x = -300
        while x<300:
            x = x + 0.5
            if (not( (not(P(x))) <= (Q(x))) ) <= ((a1<=x<=a2) <=( (not(Q(x)))<=(P(x))))   :
                None
            else:
                FLAG +=1
                break
        if FLAG ==0:
            a.append(a2-a1)

print(max(a))

