'''(№ 5765) *(Д. Статный) Среди натуральных чисел, принадлежащих промежутку [35 000 000; 100 000 000],
 найдите все числа, имеющие ровно 3 делителя, отличных от 1 и самого числа. В ответ запишите найденные числа в порядке возрастания,
  справа от каждого числа запишите его максимальный делитель, отличный от самого числа. '''

# for a1 in range(2,100000000):
#     for a2 in range(2,100000000):
#         for a3 in range(2,100000000):
#             F = a1* a2*a3
#             if 35000000 <F< 100000000:
#                 print(F,max(a1,a2,a3))
#



