'''

25 	(№ 3927) (А. Богданов) Найдите наименьшее натуральное число, которое имеет ровно 512 делителей.
 В ответе запишите сначала само число и затем его наибольший простой делитель. Подсказка: используйте основную теорему арифметики.'''
import threading


print(2*3*5*7*11*13*17*19*23)


print(2**3*3*5*7*11*13*17*19)
print((4*2*2*2*2*2*2*2))

print(2**7*3*5*7*11*13*17)
print((8*2*2*2*2*2*2))

# print(2**15*3*5*7*11*13)
# print((16*2*2*2*2*2))

print(2**7*3**3*5*7*11*13)
print((8*4*2*2*2*2))

# print(2**7*3**7*5*7*11)
# print((8*8*2*2*2))

# print(2**7*3**3*5 **3      *7*11)
# # print((8*4*4*2*2))